import Banner from './Banner/banner';
import MainInfo from './MainInfo/mainInfo';
import styles from './mainPage.module.css';

function MainPage() {
  return (
    <div className={styles.wrapper}>
      <p>
        <b>MainPage</b>
        Это случилось во время войны, когда мне было 14 лет, и я находился в
        эвакуации в Ташкенте, где жил в старом городе, в глинобитном узбекском
        жилище. В нем, на так называемой балахане, крытом помещении второго
        этажа, в груде книг — восточных и русских, среди которых было и много
        дореволюционных, я нашел «Круг чтения», составленный Львом Толстым из
        мудрых мыслей основателей всех главных религий мира, философов, ученых и
        самого Льва Николаевича. Все эти мысли были расписаны по дням, совсем
        как распорядок дня в еженедельнике, и на каждый день приходилось всего
        по несколько мудрых мыслей, а каждую неделю завершала какая-нибудь
        история, пересказанная Львом Толстым. Я читал эту книгу, как положено,
        целый год, изо дня в день. Но, конечно же, у меня иногда не хватало
        терпения, и я заглядывал вперед, а потом возвращался назад, листая
        страницы одну за другой. Среди имен мудрецов и мыслителей я часто
        встречал в этой книге имя Лао-цзы — китайского философа, основателя
        религии, существующей до сих пор — даосизма. С тех самых пор я полюбил
        притчи. Я и сейчас очень люблю эти короткие рассказы, которые исподволь
        подводят нас к простым, но так трудно дающимся человеку истинам. Прошло
        время — и я стал зачитываться евангельскими притчами, с помощью которых
        Христос проповедовал суть своего учения. И вот недавно я впервые прочел
        мудрые притчи учителей и наставников Шоу-Дао — одного из течений
        даосизма. Представляю себе, как был бы рад Лев Николаевич Толстой, если
        бы он мог познакомиться с ними. Они свежи и необычны. Казалось бы, вся
        мудрость мира высказана и записана, и невозможно себе представить, что
        есть еще на свете какое-то направление, последователи которого сохранили
        до наших дней под покровом тайны целый поток мудрости и каскад
        совершенно необыкновенных, совершенно новых притч. Тем не менее, они
        перед вами. Их открыли для вас Александр и Ирина Медведевы. Я прочел их
        все с огромным наслаждением. Жалею, что не смог познакомиться с ними в
        молодости, ведь мудрость многих из них могла бы мне помочь в трудные
        минуты жизни, а затем в зрелые годы. Герои этих рассказов — мудрецы и
        отшельники древности, но их мудрость кажется нашим современникам
        близкой, доступной и доходчивой именно потому, что она приходит к нам
        через притчи. Иногда прочтешь такую притчу и подумаешь: как же я не знал
        этого раньше, ведь это же так просто. Но это не так: для того, чтобы
        прийти к этим простым житейским и нравственным истинам, превращенным в
        притчи, потребовались усилия, жизненный опыт и плоды глубоких раздумий
        лучших представителей многих поколений. Валентин Берестов
      </p>
      <p className={styles.test_ttf}>
        <b>MainPage</b>
        Это случилось во время войны, когда мне было 14 лет, и я находился в
        эвакуации в Ташкенте, где жил в старом городе, в глинобитном узбекском
        жилище. В нем, на так называемой балахане, крытом помещении второго
        этажа, в груде книг — восточных и русских, среди которых было и много
        дореволюционных, я нашел «Круг чтения», составленный Львом Толстым из
        мудрых мыслей основателей всех главных религий мира, философов, ученых и
        самого Льва Николаевича. Все эти мысли были расписаны по дням, совсем
        как распорядок дня в еженедельнике, и на каждый день приходилось всего
        по несколько мудрых мыслей, а каждую неделю завершала какая-нибудь
        история, пересказанная Львом Толстым. Я читал эту книгу, как положено,
        целый год, изо дня в день. Но, конечно же, у меня иногда не хватало
        терпения, и я заглядывал вперед, а потом возвращался назад, листая
        страницы одну за другой. Среди имен мудрецов и мыслителей я часто
        встречал в этой книге имя Лао-цзы — китайского философа, основателя
        религии, существующей до сих пор — даосизма. С тех самых пор я полюбил
        притчи. Я и сейчас очень люблю эти короткие рассказы, которые исподволь
        подводят нас к простым, но так трудно дающимся человеку истинам. Прошло
        время — и я стал зачитываться евангельскими притчами, с помощью которых
        Христос проповедовал суть своего учения. И вот недавно я впервые прочел
        мудрые притчи учителей и наставников Шоу-Дао — одного из течений
        даосизма. Представляю себе, как был бы рад Лев Николаевич Толстой, если
        бы он мог познакомиться с ними. Они свежи и необычны. Казалось бы, вся
        мудрость мира высказана и записана, и невозможно себе представить, что
        есть еще на свете какое-то направление, последователи которого сохранили
        до наших дней под покровом тайны целый поток мудрости и каскад
        совершенно необыкновенных, совершенно новых притч. Тем не менее, они
        перед вами. Их открыли для вас Александр и Ирина Медведевы. Я прочел их
        все с огромным наслаждением. Жалею, что не смог познакомиться с ними в
        молодости, ведь мудрость многих из них могла бы мне помочь в трудные
        минуты жизни, а затем в зрелые годы. Герои этих рассказов — мудрецы и
        отшельники древности, но их мудрость кажется нашим современникам
        близкой, доступной и доходчивой именно потому, что она приходит к нам
        через притчи. Иногда прочтешь такую притчу и подумаешь: как же я не знал
        этого раньше, ведь это же так просто. Но это не так: для того, чтобы
        прийти к этим простым житейским и нравственным истинам, превращенным в
        притчи, потребовались усилия, жизненный опыт и плоды глубоких раздумий
        лучших представителей многих поколений. Валентин Берестов
      </p>
      <Banner />
      <MainInfo />
    </div>
  );
}

export default MainPage;
